{
    "Login.button.projects": "My projects",
    "Login.button.about": "About me",

    "Login.Hello": "Hello.",
    "Login.Alberto": "I'm Alberto.",
    "Login.text": "Electronic Engineer and creative person. My journery has led me to become a Frontend Developer and UI/UX designer. I believe in crafting digital experiencies that blend technology and creativity.",
    
    "nav.Projects": "Projects",
    "nav.Resume": "Resume",
    "nav.Home": "Home",

    "button.translate": "TRANSLATE",
    "button.home": "Home",

    "Projects.title": "Projects",
    "Projects.button": "Resume", 

    "Projects.journal": "A unique application designed to foster personal reflection and creativity. It combines the simplicity of writing with innovative features to enrich your journaling experience. Jot down thoughts intuitively, track your daily moods on the Emotional Calendar for insights over time, and receive inspiring prompts when you need to overcome creative blocks.",
    "Projects.taskify": "A classic to-do list project with a twist! While rooted in the simplicity of a traditional to-do list, Taskify is meticulously crafted to focus on delivering a truly unique and creative user experience. It goes beyond the standard by offering users the exciting option to create projects with multiple tasks",
    "Projects.avatar":"The ultimate platform to craft your fully personalized avatars! Unleash your creativity as you select everything from skin tone to accessories, designing avatars that truly reflect your unique identity. Save, delete, and favorite your creations.",
    "Projects.send": "A simple but pretty interface that's all about style! With a stylish login screen and a beautifully crafted layout, this project mixes colors, tools, and styles. While it is not loaded with functionality yet, it shows off a great design and offers a good user experience.",
    "Projects.POS": "A Point of Sale (POS) solution! Managing your business. Add products to your inventory and keep track of sales with detailed daily and monthly reports, including profits. Stay on top of your stock levels with an inventory report, ensuring you know exactly when to restock. Plus, export all this valuable data to Excel for your convenience.",
    "Projects.azzhakrutt": "An application focused on the development of a versatile database that manages information from four distinct profiles with two levels of access: administrator and guest. Each profile stores specific data, while administrators have the ability to add, edit, delete data, and access advanced statistics, while guests can only view the data and statistics. All of this is achieved through the efficient use of MongoDB as the primary database, ensuring effective information management and data privacy protection.",
    "Projects.todo": "The 'To-Do List' app is an easy-to-use tool that allows you to efficiently manage your daily tasks. You can easily add and edit tasks, customize each one with detailed notes, mark important ones as favorites, and organize them into three lists: 'Tasks 'Completed,' and 'Favorites.' With the ability to delete tasks, the app ensures that your list is always well-organized. Additionally, its responsive interface facilitates access from any device, providing a seamless experience and allowing you to maintain total control over your tasks, thereby enhancing your daily productivity.",


    "HomeCards.button": "Web project",

    "Resume.Description": "Frontend developer - UI/UX designer",
    "Resume.download": "DOWNLOAD",
    "Resume.projects": "PROJECTS",
    "Resume.phone": "Phone: ",
    "Resume.email": "Email: ",
    "Resume.linkedin": "Linkedin: ",

    "Resume.experience": "EXPERIENCE",
    "Resume.metamapDate": "DEC 2021 - Currently",
    "Resume.canplastDate": "FEB 2024 - Currently",

    "Resume.Meta.description": "Frontend - Backend developer / UI/UX designer / Python developer",
    "Resume.frontendDev": "Frontend - Backend developer",
    "Resume.Ecommerce": "Redesign and Restructure of the Digital Store",
    "Resume.uiux": "UI/UX designer",
    "Resume.PythonDev": "Python developer",

    "Resume.Ec1": "In my role as a Front-End Developer and UI/UX Designer, I participated in the redesign and restructuring project of the company’s online store, utilizing Shopify and Liquid. This project involved implementing new functionalities and optimizing the website’s performance, resulting in a significant improvement in the user experience and interface.",
    "Resume.Canplast.uiux": "Additionally, I have worked on designing user interfaces for various applications managed by the company. My approach has always been user-centered design, creating intuitive, responsive, and accessible experiences. To ensure the precise implementation of my designs, I consistently collaborated with other developers, maintaining visual consistency across all company products.",
    

    "Resume.full1": "In my current position, I specialize in developing user interfaces and web applications using React JS as the main set of technologies, supported by antd (Ant Design) as my UI library to maintain design consistency in the user interface.",
    "Resume.full2":"In addition to my focus on the frontend, I have taken on additional responsibilities in various stages of the project. I have configured the database in MongoDB, ensuring efficient data management. In the realm of backend development, I have created a complete API with its corresponding endpoints using Node JS.",
    "Resume.full3":"This comprehensive approach has allowed me to contribute significantly to all phases of a project, from configuring the database and developing the backend API to designing the user interface and implementing the frontend using React JS and antd (Ant Design).",

    "Resume.React1": "Currently, I specialize in React JS as my primary set of technologies. I am actively involved in the development of user interfaces and interactive web applications.",
    "Resume.React2": "My experience in React JS has allowed me to efficiently build robust and scalable frontend solutions. To streamline development and maintain design consistency, I rely on antd (Ant Design) as my go-to UI library.",

    "Resume.uiux.text": "I play a key role in the development of various projects by creating Mockups. I used Adobe Illustrator, Adobe XD and Figma as my primary tools to design detailed and appealing visual layouts. These Mockups became an essential reference for the team throughout the development process.",
    "Resume.python.text": "I worked as a Full Stack Developer, creating desktop applications (Windows) with multiple functionalities using Python. I was involved in the entire development process, from designing the frontend of the application using Illustrator and Adobe XD to its implementation in the QT Creator development environment.",

    "Resume.internship": "Internships",
    "Resume.internship_": "Graduate Laboratory of Instituto tecnológico de Chihauhua",
    "Resume.internshipDate": "AUG 2021 - JAN 2022",
    "Resume.internshipSubtitle":"Computer Vision and Machine Learning Curriculum Renewal",

    "Resume.intern.text": "I actively participated in the renewal of the curriculum for Computer Vision and Machine Learning Systems. My main responsibilities included developing Python-based exercises using the Google Colab environment.",
    "Resume.intern.text2": "I designed a series of practical exercises covering various topics, from the fundamentals of machine learning to digital image processing. These hands-on sessions involved the use of Python libraries such as Matplotlib, OpenCV, scikit-learn, among others.",
    "Resume.intern.text3": "My work aimed to enhance the learning experience of students by providing them with engaging exercises that reinforced their understanding of computer vision and machine learning concepts.",
    
    "Resume.Summary": "SUMMARY",
    "Resume.summary.text": "I am a creative and perfectionist person, passionate about both design and programming. Throughout my career, I discovered that my true calling lies in the world of programming, and becoming a frontend developer has been the perfect combination of my passion for coding and design.",
    "Resume.summary.text1": "My background in electronic engineering has provided me with a solid technical foundation and problem-solving skills.",

    "Resume.education": "EDUCATION",
    "Resume.education.text": "Electronic Engineer",
    "Resume.education.speacilization": "Specialization in Embedded Systems",
    "Resume.education.date": "DEC 2021",

    "Resume.skills": "SKILLS",
    "Resume.languages": "LANGUAGUES",
    "Resume.lan.spanish": "Spanish: ",
    "Resume.spanish": "Native",
    "Resume.lan.english": "English: ",

    
    "":""
}