{
    "Login.button.projects": "Proyectos",
    "Login.button.about": "Sobre mi",

    "button.translate": "TRADCUIR",
    "button.home": "CASA",

    "Projects.title": "Proyectos",
    "Projects.button": "CURRICULUM",

    "Projects.journal":"Una aplicación única para fomentar la reflexión personal y la creatividad. Combina la simplicidad de la escritura con innovadoras características para enriquecer tu experiencia journal. Escribe notas de manera intuitiva, marca tus estados de ánimo en el Calendario Emocional para un seguimiento a lo largo del tiempo y recibe prompts inspiradores cuando necesites superar bloqueos creativos.",
    "Projects.taskify": "Un proyecto clásico de lista de tareas con un toque especial. Aunque se basa en la simplicidad de una lista de tareas tradicional, Taskify está meticulosamente diseñado para centrarse en ofrecer una experiencia de usuario verdaderamente única y creativa. Además de lo convencional le ofrece a los usuarios la opción de crear proyectos con múltiples tareas.",
    "Projects.avatar": "¡La plataforma para crear avatares totalmente personalizados! Desata tu creatividad mientras seleccionas todo, desde el tono de piel hasta los accesorios, diseñando avatares que realmente reflejen tu identidad única. Guarda, elimina y marca como favoritas tus creaciones.",
    "Projects.send": "¡Una interfaz sencilla pero bonita que se centra en el estilo! Con una elegante pantalla de inicio de sesión y un diseño bellamente elaborado, este proyecto combina colores, herramientas y estilos. Aunque aún no está cargado de funcionalidades, muestra un gran diseño y ofrece una buena experiencia de usuario.",
    "Projects.POS": "¡Una solución de Punto de Venta (POS)! Administra tu negocio. Agrega productos a tu inventario y lleva un registro de las ventas con informes detallados diarios y mensuales, incluyendo ganancias. Mantén el control de los niveles de stock con un informe de inventario, asegurándote de saber exactamente cuándo reponer existencias. Además, exporta todos estos valiosos datos a Excel para tu comodidad.",
    
    "HomeCards.button": "Vista rápida",

    "Resume.Description": "Desarrollador Frontend - diseñador UI/UX",
    "Resume.download": "DESCARGAR",
    "Resume.projects": "PROYECTOS",
    "Resume.phone": "Teléfono: ",
    "Resume.email": "Correo electrónico: ",
    "Resume.linkedin": "Linkedin: ",

    "Resume.experience": "EXPERIENCIA",
    "Resume.metamapDate": "DIC 2021 - Actualidad",

    "Resume.Meta.description": "Desarrollador Frontend / Diseñador UI/UX / Desarrollador Python",
    "Resume.frontendDev": "Desarrollador Frontend",
    "Resume.uiux": "Diseñador UI/UX",
    "Resume.PythonDev": "Desarrollador Python",

    "Resume.React1": "Actualmente me especializo en React JS como mi principal conjunto de tecnologías. Me encuentro activamente involucrado en el desarrollo de interfaces de usuario y aplicaciones web interactivas.",
    "Resume.React2": "Mi experiencia en React JS me ha permitido construir soluciones frontend robustas y escalables de manera eficiente. Para agilizar el desarrollo y mantener la consistencia en el diseño, confío en antd (Ant Design) como mi librería de interfaz de usuario por excelencia.",

    "Resume.uiux.text": "Tuve un papel fundamental en el desarrollo de diversos proyectos al crear Mockups. Utilicé Adobe Illustrator y Adobe XD como mi herramienta principal para diseñar detallados y atractivos diseños visuales. Estos Mockups se convirtieron en una referencia esencial para el equipo durante todo el proceso de desarrollo.",
    "Resume.python.text": "Trabajé como Desarrollador Full Stack, creando aplicaciones de escritorio (windows) con múltiples funcionalidades utilizando Python. Participé en todo el proceso de desarrollo, desde el diseño del frontend de la aplicación utilizando Illustrator y Adobe XD hasta su implementación en el entorno de desarrollo de QT Creator.",
    
    "Resume.internship": "Residencias profesionales",
    "Resume.internship_": "Laboratorio de posgrado de Instituto tecnológico de Chihauhua",
    "Resume.internshipDate": "AGO 2021 - ENE 2022",
    "Resume.internshipSubtitle":"Residencias - Renovación de la materia de Visión por Computadora y Aprendizaje de Máquina.",

    "Resume.intern.text": "Participé activamente en la renovación del temario de Sistemas de Visión y Aprendizaje de Máquina. Mis principales responsabilidades incluyeron el desarrollo de prácticas en Python utilizando el entorno de Google Colab.",
    "Resume.intern.text2": "Diseñé una serie de ejercicios prácticos que abarcaban diversos temas, desde los fundamentos del aprendizaje de máquina hasta el procesamiento digital de imágenes. Estas sesiones prácticas involucraron el uso de librerías de Python como Matplotlib, OpenCV, scikit-learn, entre otras.",
    "Resume.intern.text3": "Mi trabajo tuvo como objetivo mejorar la experiencia de aprendizaje de los estudiantes al proporcionarles ejercicios interesantes que fortalecieran su comprensión de los conceptos de visión y aprendizaje de máquina.",

    "Resume.Summary": "RESUMEN",
    "Resume.summary.text": "Soy una persona creativa y perfeccionista, apasionada tanto por el diseño como por la programación. A lo largo de mi carrera, descubrí que mi verdadera vocación se encuentra en el mundo de la programación, y convertirme en desarrollador frontend ha sido la combinación perfecta de mi pasión por el código y el diseño.",
    "Resume.summary.text1": "Mi formación en ingeniería electrónica me ha dotado de una sólida base técnica y habilidades de resolución de problemas.",

    "Resume.education": "EDUCACIÓN",
    "Resume.education.text": "Ingeniería Electrónica",
    "Resume.education.speacilization": "Especialización en sistemas embebidos",
    "Resume.education.date": "DIC 2021",

    "Resume.skills": "HABILIDADES",
    "Resume.languages": "LENGUAJES",
    "Resume.lan.spanish": "Español: ",
    "Resume.spanish": "Nativo",
    "Resume.lan.english": "Inglés: ",

    "":""

    
}