{
    "Login.button.projects": "Mis proyectos",
    "Login.button.about": "Sobre mi",

    "Login.Hello": "Hola.",
    "Login.Alberto": "Soy Alberto.",
    "Login.text": "un Ingeniero Electrónico y una persona creativa. Mi trayectoria me ha llevado a convertirme en un Desarrollador Frontend y diseñador de UI/UX. Creo en crear experiencias digitales que combinen tecnología y creatividad.",
    
    "nav.Projects": "Proyectos",
    "nav.Resume": "Curriculum",
    "nav.Home": "Inicio",

    "button.translate": "TRADCUIR",
    "button.home": "Inicio",

    "Projects.title": "Proyectos",
    "Projects.button": "Curriculum",

    "Projects.journal":"Una aplicación única para fomentar la reflexión personal y la creatividad. Combina la simplicidad de la escritura con innovadoras características para enriquecer tu experiencia journal. Escribe notas de manera intuitiva, marca tus estados de ánimo en el Calendario Emocional para un seguimiento a lo largo del tiempo y recibe prompts inspiradores cuando necesites superar bloqueos creativos.",
    "Projects.taskify": "Un proyecto clásico de lista de tareas con un toque especial. Aunque se basa en la simplicidad de una lista de tareas tradicional, Taskify está meticulosamente diseñado para centrarse en ofrecer una experiencia de usuario verdaderamente única y creativa. Además de lo convencional le ofrece a los usuarios la opción de crear proyectos con múltiples tareas.",
    "Projects.avatar": "¡La plataforma para crear avatares totalmente personalizados! Desata tu creatividad mientras seleccionas todo, desde el tono de piel hasta los accesorios, diseñando avatares que realmente reflejen tu identidad única. Guarda, elimina y marca como favoritas tus creaciones.",
    "Projects.send": "¡Una interfaz sencilla pero bonita que se centra en el estilo! Con una elegante pantalla de inicio de sesión y un diseño bellamente elaborado, este proyecto combina colores, herramientas y estilos. Aunque aún no está cargado de funcionalidades, muestra un gran diseño y ofrece una buena experiencia de usuario.",
    "Projects.POS": "¡Una solución de Punto de Venta (POS)! Administra tu negocio. Agrega productos a tu inventario y lleva un registro de las ventas con informes detallados diarios y mensuales, incluyendo ganancias. Mantén el control de los niveles de stock con un informe de inventario, asegurándote de saber exactamente cuándo reponer existencias. Además, exporta todos estos valiosos datos a Excel para tu comodidad.",
    "Projects.azzhakrutt":"Una aplicación centrada en el desarrollo de una base de datos versátil que gestiona información de cuatro perfiles distintos con dos niveles de acceso: administrador e invitado. Cada perfil almacena datos específicos, mientras que los administradores tienen la capacidad de agregar, editar, eliminar datos y acceder a estadísticas avanzadas, mientras que los invitados solo pueden visualizar los datos y estadísticas. Todo esto se logra mediante el uso eficiente de MongoDB como base de datos principal, asegurando una gestión efectiva de la información y la protección de la privacidad de los datos.",
    "HomeCards.button": "Vista rápida",
    "Projects.todo": "La aplicación 'Lista To-Do' es una herramienta fácil de usar que te permite gestionar tus tareas diarias de manera eficiente. Puedes agregar y editar tareas, personalizar cada una con notas detalladas, marcar las más importantes como favoritas y organizarlas en tres listas: 'Tareas', 'Finalizadas' y 'Favoritas'. Con la capacidad de eliminar tareas, la aplicación asegura que tu lista esté siempre ordenada. Además, su interfaz responsiva facilita el acceso desde cualquier dispositivo, proporcionando una experiencia fluida y permitiéndote mantener el control total de tus tareas, mejorando así tu productividad diaria.",

    "Resume.Description": "Desarrollador Frontend - UI/UX",
    "Resume.download": "DESCARGAR",
    "Resume.projects": "PROYECTOS",
    "Resume.phone": "Teléfono: ",
    "Resume.email": "Correo electrónico: ",
    "Resume.linkedin": "Linkedin: ",

    "Resume.experience": "EXPERIENCIA",
    "Resume.metamapDate": "DIC 2021 - Actualidad",

    "Resume.Meta.description": "Desarrollador Backend - Frontend / Diseñador UI/UX / Desarrollador Python",
    "Resume.frontendDev": "Desarrollador Frontend - Backend",
    "Resume.uiux": "Diseñador UI/UX",
    "Resume.PythonDev": "Desarrollador Python",

    "Resume.full1": "En mi actual posición, me especializo en el desarrollo de interfaces de usuario y aplicaciones web utilizando React JS como principal conjunto de tecnologías, respaldado por antd (Ant Design) como mi librería de UI para mantener una coherencia de diseño en la interfaz de usuario.",
    "Resume.full2":"Además de mi enfoque en el frontend, he asumido responsabilidades adicionales en diferentes etapas del proyecto. He configurado la base de datos en MongoDB, asegurando una gestión eficiente de los datos. En el ámbito del desarrollo backend, he creado una API completa con sus respectivos endpoints utilizando Node JS.",
    "Resume.full3":"Este enfoque integral me ha permitido contribuir de manera significativa a todas las fases de un proyecto, desde la configuración de la base de datos y el desarrollo de la API backend hasta el diseño de la interfaz de usuario y la implementación frontend utilizando React JS y antd.",

    "Resume.React1": "Actualmente me especializo en React JS como mi principal conjunto de tecnologías. Me encuentro activamente involucrado en el desarrollo de interfaces de usuario y aplicaciones web interactivas.",
    "Resume.React2": "Mi experiencia en React JS me ha permitido construir soluciones frontend robustas y escalables de manera eficiente. Para agilizar el desarrollo y mantener la consistencia en el diseño, confío en antd (Ant Design) como mi librería de interfaz de usuario por excelencia.",

    "Resume.uiux.text": "Tengo un papel fundamental en el desarrollo de diversos proyectos al crear Mockups. Utilicé Adobe Illustrator, Adobe XD y Figma como mi herramienta principal para diseñar detallados y atractivos diseños visuales. Estos Mockups se convirtieron en una referencia esencial para el equipo durante todo el proceso de desarrollo.",
    "Resume.python.text": "Trabajé como Desarrollador Full Stack, creando aplicaciones de escritorio (windows) con múltiples funcionalidades utilizando Python. Participé en todo el proceso de desarrollo, desde el diseño del frontend de la aplicación utilizando Illustrator y Adobe XD hasta su implementación en el entorno de desarrollo de QT Creator.",
    
    "Resume.internship": "Residencias profesionales",
    "Resume.internship_": "Laboratorio de posgrado de Instituto tecnológico de Chihauhua",
    "Resume.internshipDate": "AGO 2021 - ENE 2022",
    "Resume.internshipSubtitle":"Residencias - Renovación de la materia de Visión por Computadora y Aprendizaje de Máquina.",

    "Resume.intern.text": "Participé activamente en la renovación del temario de Sistemas de Visión y Aprendizaje de Máquina. Mis principales responsabilidades incluyeron el desarrollo de prácticas en Python utilizando el entorno de Google Colab.",
    "Resume.intern.text2": "Diseñé una serie de ejercicios prácticos que abarcaban diversos temas, desde los fundamentos del aprendizaje de máquina hasta el procesamiento digital de imágenes. Estas sesiones prácticas involucraron el uso de librerías de Python como Matplotlib, OpenCV, scikit-learn, entre otras.",
    "Resume.intern.text3": "Mi trabajo tuvo como objetivo mejorar la experiencia de aprendizaje de los estudiantes al proporcionarles ejercicios interesantes que fortalecieran su comprensión de los conceptos de visión y aprendizaje de máquina.",

    "Resume.Summary": "RESUMEN",
    "Resume.summary.text": "Soy una persona creativa y perfeccionista, apasionada tanto por el diseño como por la programación. A lo largo de mi carrera, descubrí que mi verdadera vocación se encuentra en el mundo de la programación, y convertirme en desarrollador frontend ha sido la combinación perfecta de mi pasión por el código y el diseño.",
    "Resume.summary.text1": "Mi formación en ingeniería electrónica me ha dotado de una sólida base técnica y habilidades de resolución de problemas.",

    "Resume.education": "EDUCACIÓN",
    "Resume.education.text": "Ingeniería Electrónica",
    "Resume.education.speacilization": "Especialización en sistemas embebidos",
    "Resume.education.date": "DIC 2021",

    "Resume.skills": "HABILIDADES",
    "Resume.languages": "LENGUAJES",
    "Resume.lan.spanish": "Español: ",
    "Resume.spanish": "Nativo",
    "Resume.lan.english": "Inglés: ",

    "":""

    
}